module.exports = {
    /**
    * !#en Current game index.
    * !#zh 当前游戏关卡
    * @member guanqia_dq
    */
    guanqia_dq: 0,
    //关卡剩余卡牌
    guanqia_syks: [],
    //剧情文字索引
    wz_sy: 1,

    //主角索引
    zj_sy: 0,
    kp_xh: 0,



    // tujian_yifanxian_bool:0,
    // //故事的列表
    // t_shuzu_tujian_fangkuai:{
    //     default:[],
    //     type:[cc.Prefab]
    // },



    //打乱数组循序

    // riji_jindu_biaoti:[
    //     "taidi",
    //     "xiaomao",


    // ],
    guanqia_syks: [18, 20, 22, 24, 26, 28, 30, 32, 34, 36, 38],
    guanqia1: [
        { "ys": "1/7", "name": "龙介", "nr": "﹁一切都要从那个夜晚一个女人开始说起。﹂" },
        { "ys": "2/7", "name": "龙介", "nr": "﹁那时候我六岁，正心烦意乱的在街上游荡﹂" },
        { "ys": "3/7", "name": "龙介", "nr": "﹁那个女人叫住了我﹂" },
        { "ys": "4/7", "name": "姑姑", "nr": "﹁姐姐怀上一个人孩子﹂" },
        { "ys": "5/7", "name": "姑姑", "nr": "﹁虽然他已经有了老婆，并且让我打掉孩子﹂" },
        { "ys": "6/7", "name": "姑姑", "nr": "﹁但是我依然很爱她﹂" },
        { "ys": "7/7", "name": "姑姑", "nr": "﹁我好苦恼，我应该和继续交往么﹂", },
        { "ys": "", "name": "第一章", "nr": "十字路口的美少年", "ys": "第一页" },
        { "ys": "", "name": "任务", "nr": "击杀BOSS︻姑姑︼", "ys": "点击开始游戏" },
    ],
    guanqia2: [
        { "ys": "", "name": "", "nr": "﹁顺利过关﹂" },
        { "ys": "1/11", "name": "龙介", "nr": "﹁之后，那个女人在十字路口自杀了，现场惨烈﹂" },
        { "ys": "2/11", "name": "龙介", "nr": "﹁我也就那个时候离开了镇子。﹂" },
        { "ys": "3/11", "name": "龙介", "nr": "﹁直到6年后，由于父亲的缘故，我回到了小镇﹂" },
        { "ys": "4/11", "name": "龙介", "nr": "﹁这里还是那时候一样，白雾茫茫﹂" },
        { "ys": "5/11", "name": "龙介", "nr": "﹁在学校里，我找到了幼稚园时的玩伴—美登里。﹂" },
        { "ys": "6/11", "name": "美登里", "nr": "﹁跟你介绍一下这位是B班的田中铃枝。﹂" },
        { "ys": "7/11", "name": "田中铃枝", "nr": "﹁你好，班上的同学最近都在讨论你呢。﹂" },
        { "ys": "8/11", "name": "田中铃枝", "nr": "﹁说有个帅气的男生转学过来﹂" },
        { "ys": "9/11", "name": "田中铃枝", "nr": "﹁不过有美登里在，大家肯定都没有胜算呢﹂" },
        { "ys": "10/11", "name": "田中铃枝", "nr": "﹁美登里可是学校的大美女呢﹂" },
        { "ys": "11/11", "name": "田中铃枝", "nr": "﹁无数男生的﹁占卜目标﹂都是她呢﹂" },
        { "ys": "", "name": "第一章", "nr": "十字路口的美少年", "ys": "第二页" },
        { "ys": "", "name": "任务", "nr": "击杀BOSS︻中田玲枝︼", "ys": "点击开始游戏" },
    ],
    guanqia3: [
        { "ys": "", "name": "", "nr": "﹁顺利过关﹂" },
        { "ys": "1/6", "name": "娜美", "nr": "﹁今天浓雾看起来是个占卜的好机会﹂" },
        { "ys": "2/6", "name": "娜美", "nr": "﹁我站在十字路口，等待着有缘人﹂" },
        { "ys": "3/6", "name": "娜美", "nr": "﹁然而，令我没想到的是﹂" },
        { "ys": "4/6", "name": "娜美", "nr": "﹁迎面而来了一位美少年，我瞬间被迷得神魂颠倒﹂" },
        { "ys": "5/6", "name": "娜美", "nr": "﹁我赶紧用背包遮住了脸﹂" },
        { "ys": "6/6", "name": "娜美", "nr": "﹁请问我的恋爱会实现么﹂" },
        { "ys": "", "name": "第一章", "nr": "十字路口的美少年", "ys": "第三页" },
        { "ys": "", "name": "任务", "nr": "击杀BOSS︻娜美︼", "ys": "点击开始游戏" },
    ],
    guanqia4: [
        { "ys": "", "name": "", "nr": "﹁顺利过关﹂" },
        { "ys": "1/5", "name": "龙介", "nr": "﹁听说十字路口开始自杀了，真是令人烦恼。﹂" },
        { "ys": "2/5", "name": "龙介", "nr": "﹁而我无意间总想躲着美登里。﹂" },
        { "ys": "3/5", "name": "中田铃枝", "nr": "﹁……所以说美登里很烦恼呢﹂" },
        { "ys": "4/5", "name": "中田铃枝", "nr": "﹁她认为龙介你讨厌他了，你到底是怎么想的呢﹂" },
        { "ys": "5/5", "name": "中田铃枝", "nr": "﹁你是讨厌她了么﹂" },
        { "ys": "", "name": "第一章", "nr": "十字路口的美少年", "ys": "第四页" },
        { "ys": "", "name": "任务", "nr": "击杀BOSS︻中田玲枝︼", "ys": "点击开始游戏" },
    ],
    guanqia5: [
        { "ys": "", "name": "", "nr": "﹁顺利过关﹂" },
        { "ys": "1/12", "name": "中田铃枝", "nr": "﹁龙介事情，让我还苦恼，我迷糊走到十字路口﹂" },
        { "ys": "2/12", "name": "中田铃枝", "nr": "﹁一个美少年走了过来﹂" },
        { "ys": "3/12", "name": "中田铃枝", "nr": "﹁不如先考虑下自己的恋爱吧，真是一下点醒了我﹂" },
        { "ys": "4/12", "name": "美登里", "nr": "﹁那个……铃枝，龙介有对你说什么么﹂" },
        { "ys": "5/12", "name": "中田铃枝", "nr": "﹁我遇见他了，在十字路口，让人浑身颤抖的俊美少年﹂" },
        { "ys": "6/12", "name": "中田铃枝", "nr": "﹁他让我看清楚自己的伪装﹂" },
        { "ys": "7/12", "name": "中田铃枝", "nr": "﹁从今往后我要真实的活下去﹂" },
        { "ys": "8/12", "name": "中田铃枝", "nr": "﹁美子，对不起了我喜欢龙介﹂" },
        { "ys": "9/12", "name": "中田铃枝", "nr": "﹁从他转校过来的那天起，所以﹂" },
        { "ys": "10/12", "name": "中田铃枝", "nr": "﹁当他跟你分手是我感觉好幸福啊﹂" },
        { "ys": "11/12", "name": "中田铃枝", "nr": "﹁再见，我要向龙介告白﹂" },
        { "ys": "12/12", "name": "中田铃枝", "nr": "﹁哈哈哈哈哈﹂" },
        { "ys": "", "name": "第一章", "nr": "十字路口的美少年", "ys": "第五页" },
        { "ys": "", "name": "任务", "nr": "击杀BOSS︻中田玲枝︼", "ys": "点击开始游戏" },
    ],
    guanqia6: [
        { "ys": "", "name": "", "nr": "﹁顺利过关﹂" },
        { "ys": "1/9", "name": "龙介", "nr": "﹁铃枝向我告白了，开始主动接近我。﹂" },
        { "ys": "2/9", "name": "龙介", "nr": "﹁委婉的拒绝他根本听不下去﹂" },
        { "ys": "3/9", "name": "龙介", "nr": "﹁夜晚不停的给我打电话﹂" },
        { "ys": "4/9", "name": "龙介", "nr": "﹁早上则在玄关等着我﹂" },
        { "ys": "5/9", "name": "龙介", "nr": "﹁她的脸日益发生变化﹂" },
        { "ys": "6/9", "name": "龙介", "nr": "﹁简直像一个病人，被恋爱缠身的病人﹂" },
        { "ys": "7/9", "name": "龙介", "nr": "﹁铃枝你弄够了没，我打翻了她的便当﹂" },
        { "ys": "8/9", "name": "龙介", "nr": "﹁我喜欢的是美登里﹂" },
        { "ys": "9/9", "name": "龙介", "nr": "﹁我的心里没有你进入的余地，你给我消失吧﹂" },
        { "ys": "", "name": "第一章", "nr": "十字路口的美少年", "ys": "第六页" },
        { "ys": "", "name": "任务", "nr": "击杀BOSS︻中田玲枝︼", "ys": "点击开始游戏" },
    ],
    guanqia7: [
        { "ys": "", "name": "", "nr": "﹁顺利过关﹂" },
        { "ys": "1/8", "name": "龙介", "nr": "﹁之后我就后悔了，我说的话有点太重了﹂" },
        { "ys": "2/8", "name": "龙介", "nr": "﹁放学后，我跟铃枝道歉﹂" },
        { "ys": "3/8", "name": "龙介", "nr": "﹁我讨厌的并不是她﹂" },
        { "ys": "4/8", "name": "龙介", "nr": "﹁只是我现在还忘不了美登里﹂" },
        { "ys": "5/8", "name": "龙介", "nr": "﹁所以不能跟其他女生恋爱﹂" },
        { "ys": "6/8", "name": "龙介", "nr": "﹁都怪我暧昧不清再让她变成这样子﹂" },
        { "ys": "7/8", "name": "龙介", "nr": "﹁然而，我没想到我的这些安慰的话﹂" },
        { "ys": "8/8", "name": "龙介", "nr": "﹁把她推向了深渊﹂" },
        { "ys": "", "name": "第一章", "nr": "十字路口的美少年", "ys": "第七页" },
        { "ys": "", "name": "任务", "nr": "击杀BOSS︻中田玲枝︼", "ys": "点击开始游戏" },
    ],
    guanqia8: [
        { "ys": "", "name": "", "nr": "﹁顺利过关﹂" },
        { "ys": "1/8", "name": "龙介", "nr": "﹁铃枝死了，听说他生前占卜也碰见美少年了﹂" },
        { "ys": "2/8", "name": "龙介", "nr": "﹁这和十年前我所做的一模一样﹂" },
        { "ys": "3/8", "name": "龙介", "nr": "﹁绝对不能放任他不管﹂" },
        { "ys": "4/8", "name": "龙介", "nr": "﹁那家伙会在浓雾时出现﹂" },
        { "ys": "5/8", "name": "龙介", "nr": "﹁我一定要抓住它﹂" },
        { "ys": "6/8", "name": "龙介", "nr": "﹁于是，我走近了迷雾﹂" },
        { "ys": "7/8", "name": "龙介", "nr": "﹁我一边给别人占卜，一边寻找的美少年﹂" },
        { "ys": "8/8", "name": "龙介", "nr": "﹁而就在此刻，一个浑身是血的女生正站立在路口处﹂" },
        { "ys": "", "name": "第一章", "nr": "十字路口的美少年", "ys": "第八页" },
        { "ys": "", "name": "任务", "nr": "击杀BOSS︻里美的冤魂︼", "ys": "点击开始游戏" },

    ],
    guanqia9: [
        { "ys": "", "name": "", "nr": "﹁顺利过关﹂" },
        { "ys": "1/6", "name": "龙介", "nr": "﹁这真是不可思议﹂" },
        { "ys": "2/6", "name": "龙介", "nr": "﹁那个女人脖子上隔了那么深﹂" },
        { "ys": "3/6", "name": "龙介", "nr": "﹁应该早就站不起来了……难……难道她是﹂" },
        { "ys": "4/6", "name": "龙介", "nr": "﹁没错他们可能就是自杀的少女们的冤魂﹂" },
        { "ys": "5/6", "name": "龙介", "nr": "﹁而就在此刻﹂" },
        { "ys": "6/6", "name": "龙介", "nr": "﹁我看见了一个熟悉的身影……那是﹂" },
        { "ys": "", "name": "第一章", "nr": "十字路口的美少年", "ys": "第九页" },
        { "ys": "", "name": "任务", "nr": "击杀BOSS︻玲枝的冤魂︼", "ys": "点击开始游戏" },

    ],
    guanqia10: [
        { "ys": "", "name": "", "nr": "﹁顺利过关﹂" },
        { "ys": "1/10", "name": "龙介", "nr": "﹁我一路狂奔，心里满是忏悔﹂" },
        { "ys": "2/10", "name": "龙介", "nr": "﹁铃枝对不起，原谅我吧﹂" },
        { "ys": "3/10", "name": "龙介", "nr": "﹁我遇见了美登里，这里真是危险﹂" },
        { "ys": "4/10", "name": "龙介", "nr": "﹁我粗暴的离开了她，想尽快的找到美少年﹂" },
        { "ys": "5/10", "name": "龙介", "nr": "﹁迷雾越来越浓﹂" },
        { "ys": "6/10", "name": "龙介", "nr": "﹁我看见了一个人的身影没错就是他﹂" },
        { "ys": "7/10", "name": "龙介", "nr": "﹁我慌张的跑了过去时，黑影已经不见了﹂" },
        { "ys": "8/10", "name": "龙介", "nr": "﹁身后却有些动静﹂" },
        { "ys": "9/10", "name": "龙介", "nr": "﹁我扭头一看，竟然是﹂" },
        { "ys": "10/10", "name": "龙介", "nr": "﹁她﹂" },
        { "ys": "", "name": "第一章", "nr": "十字路口的美少年", "ys": "第十页" },
        { "ys": "", "name": "任务", "nr": "击杀BOSS︻姑姑冤魂︼", "ys": "点击开始游戏" },

    ],
    guanqia11: [
        { "ys": "", "name": "", "nr": "﹁顺利过关﹂" },
        { "ys": "1/6", "name": "龙介", "nr": "﹁没错，那就是美登里的姑姑﹂" },
        { "ys": "2/6", "name": "龙介", "nr": "﹁十年前，被我害死的女人﹂" },
        { "ys": "3/6", "name": "龙介", "nr": "﹁她此时是来向我报仇的么﹂" },
        { "ys": "4/6", "name": "龙介", "nr": "﹁只见她手指向了右边﹂" },
        { "ys": "5/6", "name": "龙介", "nr": "﹁那个方向，闪过黑衣美少年的身影﹂" },
        { "ys": "6/6", "name": "龙介", "nr": "﹁我拼命的追了过去﹂" },
        { "ys": "", "name": "第一章", "nr": "十字路口的美少年", "ys": "第十一页" },
        { "ys": "", "name": "任务", "nr": "击杀BOSS︻黑衣美少年︼", "ys": "点击开始游戏" },
    ],
    // xiaoxingxing_1 :[
    //     {"changming":"c441","changdu":"1"},
    //     {"changming":"c441","changdu":"1"},
    //     {"changming":"c411","changdu":"2"}
    // ],

    // get_rand_num_duihuaqipao_fxql:function (){
    //     var num = Math.floor(Math.random()*3);
    //     if(num == this.suiji_next)
    //         {
    //             num = this.get_rand_num();
    //         }
    //     return num;
    // },
}; 